app/views/admin/items/new.html.erb

      <div class="col-lg-3 d-flex align-items-center"><%= f.label :genre_id, "ジャンル" %></div>
      <div class="col-lg-7"><%= f.collection_select :genre_id, Genre.all, :id, :name, {include_blank: "選択して下さい"}, {class: "form-control"} %></div>
---
SELECT "genres".* FROM "genres"