app/controllers/admin/customers_controller.rb

SELECT  "customers".* FROM "customers" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @customers = Customer.all.page(params[:page])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "customers" SET "is_deleted" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_deleted", 0], ["updated_at", "2022-10-07 09:06:31.432298"], ["id", 3]]
---
  def update
    @customer = Customer.find(params[:id])
    if @customer.update(customer_params)