app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "プリン"], ["created_at", "2022-09-28 19:35:56.618149"], ["updated_at", "2022-09-28 19:35:56.618149"]]
---
  def create
    @genres = Genre.all
    @genre = Genre.new(genre_params)
    if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "タルト"], ["updated_at", "2022-10-02 14:28:03.092040"], ["id", 5]]
---
  def update
    @genre = Genre.find(params[:id])
    if @genre.update(genre_params)