app/controllers/admin/homes_controller.rb

SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def top
    @orders = Order.all.page(params[:page]).reverse_order

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["customer_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
---
  def show
    @customer = Customer.find(params[:id])
    @orders = Order.where(customer_id: @customer.id).page(params[:page]).reverse_order