app/controllers/admin/items_controller.rb

SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
  def index
    @items = Item.page(params[:page])

INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "genre_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "1eb7856dba55b39695767196431217b2f505ac37623e75cfbdd8b5aa5d2a"], ["genre_id", 4], ["updated_at", "2022-10-04 14:45:41.087197"], ["id", 4]]
---
  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)