app/controllers/admin/order_details_controller.rb

SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 2], ["updated_at", "2022-10-01 07:21:06.768487"], ["id", 1]]
UPDATE "order_details" SET "create_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["create_status", 2], ["updated_at", "2022-10-02 09:03:52.824074"], ["id", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 2], ["updated_at", "2022-10-05 23:57:42.695676"], ["id", 4]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 4]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 3], ["updated_at", "2022-10-02 17:51:41.956631"], ["id", 3]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ? AND "order_details"."create_status" != ?  [["order_id", 1], ["create_status", 3]]
---
  def update
    @order_detail = OrderDetail.find(params[:id])
    @order = @order_detail.order
    @order_details = @order.order_details.all
    @check_number = 0
    if @order_detail.update(order_detail_params)
      flash[:success] = '製作ステータスを更新しました。'
      if @order_detail.create_status == OrderDetail.create_statuses.key(2)
        if @order.order_status == Order.order_statuses.key(1)
          @order.order_status = Order.order_statuses.key(2)
          @order.save
          flash[:notice] = '注文ステータスが変更されました。'
        end
      elsif @order_detail.create_status == OrderDetail.create_statuses.key(3)
        @order_details.each do |order_detail|
          unless order_detail.create_status == OrderDetail.create_statuses.key(3)
            @check_number += 1
          end
        end
        if @check_number == 0
          @order.order_status = Order.order_statuses.key(3)
          @order.save
          flash[:notice] = '注文ステータスが変更されました。'
        end
      end
      redirect_to admin_order_path(@order_detail.order_id)