app/controllers/admin/orders_controller.rb

  def update
    @order = Order.find(params[:id])
    @order_details = @order.order_details.all
    if @order.update(order_params)
      flash[:success] = '注文ステータスを更新しました。'
      if @order.order_status == Order.order_statuses.key(1)
        @order_details.each do |order_detail|
          order_detail.create_status = OrderDetail.create_statuses.key(1)
          order_detail.save
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
UPDATE "order_details" SET "create_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["create_status", 1], ["updated_at", "2022-10-01 07:02:50.484698"], ["id", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 1], ["updated_at", "2022-10-05 23:52:10.965773"], ["id", 4]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 3]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 4]]
UPDATE "order_details" SET "create_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["create_status", 1], ["updated_at", "2022-10-05 23:52:11.005907"], ["id", 6]]