app/views/admin/orders/show.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <%= link_to(admin_customer_path(@order.customer_id)) do %>
        <%= @order.customer.last_name %><%= @order.customer.first_name %>

SELECT "orders".* FROM "orders"
---
    <div class="col-lg-2 d-flex align-items-center">注文ステータス</div>
    <div class="col-lg-3 d-flex align-items-center"><%= f.select :order_status, Order.order_statuses.keys.map {|k|[I18n.t("enums.order.order_status.#{k}"), k]} %></div>

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
      <tbody>
        <% @order.order_details.all.each do |order_detail| %>

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]
---
            <td class="align-middle"><%= order_detail.subtotal_tax_price_purchase.to_s(:delimited, delimiter: ',') %></td>
            <td class="align-middle"><%= f.select :create_status, OrderDetail.create_statuses.keys.map {|k|[I18n.t("enums.order_detail.create_status.#{k}"), k]} %></td>