app/controllers/public/addresses_controller.rb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ? LIMIT ? OFFSET ?  [["customer_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @addresses = current_customer.addresses.all.page(params[:page]).per(5)

SELECT "addresses".* FROM "addresses"
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "prefecture_code", "address_city", "address_street", "address_building", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @addresses = current_customer.addresses.all
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    if @address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @address = Address.find(params[:id])

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "addresses" SET "name" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["name", "テスト次郎"], ["updated_at", "2022-10-02 16:45:17.944153"], ["id", 3]]
---
  def update
    @address = Address.find(params[:id])
    if @address.update(address_params)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 2]]
---
  def destroy
    address = Address.find(params[:id])
    address.destroy