app/controllers/public/cart_items_controller.rb

  def update
    @cart_item = CartItem.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]