app/controllers/public/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
  def index
    @cart_items = current_customer.cart_items.page(params[:page]).per(5)

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 1], ["item_id", 7], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 4], ["updated_at", "2022-10-02 17:00:52.444636"], ["id", 5]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 3], ["customer_id", 1], ["amount", 3], ["created_at", "2022-10-02 16:56:52.375877"], ["updated_at", "2022-10-02 16:56:52.375877"]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 7], ["customer_id", 1], ["amount", 1], ["created_at", "2022-10-04 17:58:52.202594"], ["updated_at", "2022-10-04 17:58:52.202594"]]
---
  def create
    @genres = Genre.all
    @cart_item = CartItem.new(cart_item_params)
    @cart_item.customer_id = current_customer.id
    if current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id]).present?
       @cart_item = current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
       @cart_item.amount += params[:cart_item][:amount].to_i
       @cart_item.save
       flash[:notice] = "#{@cart_item.item.name}はカートに登録済みの商品です。注文数を追加変更しました。"
			 redirect_to cart_items_path
    elsif @cart_item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 6], ["updated_at", "2022-10-07 08:56:44.134010"], ["id", 30]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 28]]
---
  def destroy
    @cart_item = CartItem.find(params[:id])
    @cart_item.destroy

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 33]]
---
  def destroy_all
    @cart_items = current_customer.cart_items
    if @cart_items.present?
      @cart_items.destroy_all