app/controllers/public/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @customer = Customer.find(params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "customers" SET "is_deleted" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_deleted", 1], ["updated_at", "2022-10-06 00:56:27.318098"], ["id", 2]]
---
  def withdrawal
    @customer = Customer.find(params[:id])
    @customer.update(is_deleted: true)