app/controllers/public/genres_controller.rb

SELECT "genres".* FROM "genres"
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."genre_id" = ? AND "items"."is_active" = ? LIMIT ? OFFSET ?  [["genre_id", 1], ["is_active", 1], ["LIMIT", 12], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."genre_id" = ? AND "items"."is_active" = ?  [["genre_id", 2], ["is_active", 1]]
---
  def show
    @genres = Genre.all
    @genre = Genre.find(params[:id])
    @item_selects = Item.where(genre_id: @genre.id, is_active: true)
    @items = @item_selects.page(params[:page]).per(12)