app/controllers/public/items_controller.rb

  def index
    @genres = Genre.all
    @item_selects = Item.where(is_active: true)
    @items = @item_selects.page(params[:page]).per(12)
---
SELECT "genres".* FROM "genres"
SELECT "items".* FROM "items" WHERE "items"."is_active" = ?  [["is_active", 0]]
SELECT  "items".* FROM "items" WHERE "items"."is_active" = ? LIMIT ? OFFSET ?  [["is_active", 1], ["LIMIT", 12], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "items" WHERE "items"."is_active" = ? LIMIT ? OFFSET ?) subquery_for_count  [["is_active", 1], ["LIMIT", 12], ["OFFSET", 0]]

  def show
    @genres = Genre.all
    @cart_item = CartItem.new
    @item = Item.find(params[:id])
---
SELECT "genres".* FROM "genres"
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]