app/controllers/public/orders_controller.rb

  def create
    cart_items = current_customer.cart_items.all
    @order = Order.new(order_params)
    if @order.save
      cart_items.each do |cart_item|
        @order_detail = OrderDetail.new
        @order_detail.order_id = @order.id
        @order_detail.item_id = cart_item.item_id
        @order_detail.amount = cart_item.amount
        @order_detail.price_purchase = cart_item.item.add_tax_price
        @order_detail.save
      end
      flash[:notice] = 'ご注文が確定し、カート内が空になりました。'
      redirect_to thanks_orders_path
      cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "orders" ("customer_id", "postal_code_item", "prefecture_code_item", "address_city_item", "address_street_item", "address_building_item", "name_item", "postage", "total_amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "order_details" ("order_id", "item_id", "amount", "price_purchase", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 4], ["item_id", 1], ["amount", 1], ["price_purchase", 165], ["created_at", "2022-10-04 17:45:53.471349"], ["updated_at", "2022-10-04 17:45:53.471349"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 10]]

  def confirm
    @order = Order.new(order_params)
    @order.customer_id = current_customer.id
    @order.postage = 800
    @cart_items = current_customer.cart_items
    @sum_item_price = 0

    if order_params[:payment].nil?
      flash.now[:warning] = "支払い方法を選択してください。"
      render :new
    else

      if params[:order][:selected_address] == "1"
        @order.postal_code_item = current_customer.postal_code
        @order.prefecture_code_item = current_customer.prefecture_code
        @order.address_city_item = current_customer.address_city
        @order.address_street_item = current_customer.address_street
        @order.address_building_item = current_customer.address_building
        @order.name_item = current_customer.last_name + current_customer.first_name


      elsif params[:order][:selected_address] == "2"
        if params[:order][:address_id] == ""
          flash.now[:warning] = "登録済み住所を選択してください。"
          render :new
        else
          @address = Address.find(params[:order][:address_id])
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? LIMIT ? OFFSET ?  [["customer_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

        @address.address_street = order_params[:address_street_item]
        @address.address_building = order_params[:address_building_item]
        @address.name = order_params[:name_item]
        if @address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "prefecture_code", "address_city", "address_street", "address_building", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
    @orders = current_customer.orders.all.page(params[:page]).reverse_order
---
SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["customer_id", 2], ["LIMIT", 10], ["OFFSET", 0]]

  def show
    @order = Order.find(params[:id])
    @order_details = @order.order_details.all.page(params[:page]).per(5)
    @order_details_total = @order.order_details.all
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
SELECT COUNT(*) FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 4]]
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ? LIMIT ? OFFSET ?  [["order_id", 4], ["LIMIT", 10], ["OFFSET", 0]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]