app/views/public/orders/index.html.erb

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
          <td class="align-middle" style="width: 210px;">
            <% order.order_details.all.each do |order_detail| %>