app/views/public/orders/new.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 1]]
---
      <%= f.label :selected_address, "登録済み住所から選択" %></br>
    　<%= f.select :address_id, options_from_collection_for_select(current_customer.addresses, :id, :full_address), prompt: "住所を選択してください" %>